---
kind: type
id: T:Autodesk.Revit.DB.ExportRange
source: html/a0e98f2d-3da3-c6bb-a27e-7460f7293781.htm
---
# Autodesk.Revit.DB.ExportRange

This enum is used to define what view, part of the view, or list of views will be exported.

## Syntax (C#)
```csharp
public enum ExportRange
```